{
  "title": "Soll: savings, opportunity, literacy, and legacy",
  "subTitle": "An Innovative Rotational Savings System",
  "overview": {
    "description": "Soll, a pioneering Rotational Savings System, is envisioned as a community-centric platform aiming to redefine how individuals save, collaborate, and progress financially. Drawing inspiration from traditional savings practices known globally, such as 'chit funds' in India, 'tandas' in Mexico, and 'stokvels' in South Africa, Soll aims to blend these age-old values with modern digital management. This creates a secure, adaptive, and inclusive environment where each participant's unique financial standing is acknowledged and catered to.",
    "innovation": "The essence of Soll's innovation lies in its ability to promote sustainable savings within groups while providing a safety net against potential defaults. The system is open to everyone at no cost. However, contribution fees are necessary as they help in maintaining the system and assist in providing support in case of default."
  },
  "systemInfrastructure": {
    "modelDescription": "The Soll model is simple. Participants make small contributions to a communal fund, then receive a calculated lump sum based on Soll’s different systems.",
    "subdivisions": {
      "earlyPayoutSystem": {
        "description": "The EPS caters to participants who have a more robust financial standing. Prospective participants undergo a comprehensive vetting process to ascertain a consistent source of income, thereby ensuring their ability to adhere to the contribution schedule. Participants in the EPS contribute a regular due according to their group schedule, and the payout journey commences at the cycle's midpoint, with the first participant receiving the total amount of two contribution periods. Subsequent payouts follow throughout the remaining contribution periods, with each participant receiving an equal sum, adopting a 'first join, first paid' model."
      },
      "endOfCyclePayoutSystem": {
        "description": "The ECPS is designed for participants whose financial strength isn't as robust, allowing them a secure platform to save. Participants in the ECPS also contribute on a regular basis according to their group schedule. However, payments are disbursed at the end of the cycle, ensuring all participants receive a lump sum equivalent to their total contributions, fostering a no loss, no gain, lump sum saving scenario."
      }
    }
  },
  "operationalInfrastructure": {
    "groupStructure": "Groups are meticulously formed with a fixed number of participants. The city-specific grouping ensures localized management and support through city-based group leaders. Depending on the contribution size, the system will automatically decide the required number of participants for the EPS system, and suggest a number of participants based on the duration and vice versa for the ECPS system. Each group will only be composed of participants of the same city and a group leader from the same city will be managing the group.",
    "groupStrength": "Group Strength reflects the collective financial health and commitment of a group. It's calculated by averaging the reputation scores of all members, taking into account the timeliness of their contributions. This metric gives you a clear picture of the group's overall reliability and cooperative spirit, encouraging timely participation and financial responsibility.",
    "groupLeaders": {
      "responsibilities": "Group Leaders ensure that participants from their group understand the systems and the rules of the Soll platform. They meet with participants on a monthly basis in a group meeting to ensure compliance and ease of use of the Soll digital platform. A key responsibility of groups leaders is to facilitate alternative contribution methods for participants unable to use electronic payments on the platform. This includes accepting money orders made payable to Soll, or utilizing transfer services like MoneyGram or WesternUnion.",
      "selection": "Group leaders are meticulously vetted to guarantee they are trustworthy and understand their responsibilities.",
      "interview": "Formal interviews are conducted to ensure leaders understand their responsibilities."
    },
    "digitalManagement": "The Soll digital platform serves as the primary hub for participant interaction, contributions tracking, and system updates, promoting an engaged and informed community."
  },
  "defaultManagement": "A structured approach to managing defaults, encompassing early risk detection during the vetting process, and provision of grace periods for participants facing unforeseen adversities. The duration of grace periods is assessed based on individual circumstances, ensuring a fair and supportive approach to tackling defaults.",
  "reputationAndExitSystem": {
    "description": "The reputation system, driven by a computerized algorithm, assesses participants' financial strength and adherence to Soll's guidelines. Participants commence with varied reputation points, evolving over time based on their interaction with the system. Soll groups operate and approve participants on a reputation basis. Depending on the contribution size, some Soll groups allow users with higher reputation than others.",
    "gracePeriods": "Participants facing financial hardship may be given a grace period while the system covers for their payments. However, this grace period will be given on a discretionary basis and the participant’s reputation points could be affected consequently.",
    "defaultConsequences": "If the grace period has passed and the participant misses more than two consecutive payments after payouts, Soll will partner with local collection agencies to recover the remaining funds and take legal actions, if necessary."
  },
  "transparencyCommitment": "Maintaining an open communication channel via the Soll digital platform, participants are regularly updated on system modifications, fee structures, and general announcements, ensuring an informed participant community.",
  "illustrativeExample": {
    "groupSize": "Group Size: ( n = 10 ) participants.",
    "contribution": "Contribution: ( x = $500 ) every two weeks over 40 weeks",
    "epsExample": ["Payouts start from week 20.", "The first participant receives $10,000, and continues to make contributions until the end of the cycle.", "Two weeks later, the next participant receives $10,000 and continues to make contributions until the end, and so on…"],
    "ecpExample": ["Payouts occur at the end.", "All participants receive $10,000 and no more contribution is required.", "End of cycle."]
  },
  "legalAndRegulatoryCompliance": "Engagement with financial legal experts is paramount to navigating the regulatory landscape, ensuring Soll's operation aligns with legal requirements pertaining to fund management, especially as it operates across different states within the US.",
  "scalabilityAndAdaptability": "The phased launch approach, starting with two to three states at a time, ensures a controlled and compliant expansion. This strategy also allows for adaptability to regional financial regulations and economic conditions.",
  "communityEngagement": "A concerted outreach and education effort through advertising, community gatherings, and direct engagements by Soll representatives will foster awareness and understanding of Soll's benefits within communities.",
  "financialSustainability": "While fee collections form the backbone of Soll’s operational sustainability, strategic partnerships with financial institutions are envisaged to bolster financial support. These partnerships, focused on non-personal data sharing and advertising opportunities on the Soll digital platform, are explored in a separate proposal document detailing the mutual benefits and operational dynamics. If you wish to partner with us, please feel free to contact us for more details",
  "appendices": {
    "sollName": "Soll: The name of the Rotational Savings System project aimed at creating a community-centric platform for sustainable savings.",
    "rotationalSavingsSystem": "A savings model where participants contribute funds over a specified period, with payouts occurring either mid-cycle or at the end of the cycle based on the system structure.",
    "earlyPayoutSystem": "A system structure within Soll where payouts commence at the cycle's midpoint, adhering to a 'first join, first paid' model.",
    "endOfCyclePayoutSystem": "A system structure within Soll where payouts are disbursed at the end of the cycle to all participants.",
    "contributionPeriod": "The frequency at which participants are required to make contributions, e.g., bi-weekly.",
    "cycle": "The total duration of a Soll group over which contributions are made by participants, before the group recapitulates.",
    "payout": "The disbursement of accumulated contributions to participants according to the rules of EPS or ECPS.",
    "groupLeader": "A vetted individual responsible for managing a Soll group, ensuring compliance, and guiding participants through the process.",
    "digitalManagementDefinition": "The use of the Soll digital platform for overseeing, maintaining, and monitoring the entire system including participant interactions and financial transactions.",
    "defaultManagementDefinition": "The structured approach to handle participant defaults, including provision of grace periods and partnering with collection agencies when necessary.",
    "gracePeriodDefinition": "A discretionary period provided to participants facing financial hardship, during which they are allowed to delay their contributions without penalty.",
    "reputationSystem": "A computerized algorithm that assesses participants' financial strength and adherence to Soll's guidelines, assigning a reputation score that impacts their participation.",
    "transparencyCommitmentDefinition": "Soll's pledge to maintain open communication with participants, keeping them informed on system modifications, fee structures, and general announcements.",
    "financialSustainabilityDefinition": "The strategies employed to ensure Soll's operational sustainability, including fee collections and strategic partnerships with financial institutions.",
    "nonPersonalData": "Aggregated or anonymized data that does not contain personally identifiable information, shared with partners for research and other purposes."
  }
}
