{
  "termsAndConditionsTitle": "Terms and Conditions",
  "introduction": {
    "content": "Welcome to The Soll Initiative Project. This document outlines the Terms and Conditions (T&Cs) that govern your use of our rotational savings system. By accessing and using our services, you agree to these T&Cs."
  },
  "userRegistrationAndAccounts": {
    "content": "To use our services, you must register and create an account. You must provide accurate and complete information during the registration process. You are responsible for maintaining the confidentiality of your account information and for all activities that occur under your account."
  },
  "contributionsAndPayouts": {
    "content": "You agree to adhere to the contribution requirements as set forth by the Early Payout System (EPS) or the End Of Cycle Payout System (ECPS) you participate in. Payouts will be made according to the system rules and schedule."
  },
  "groupParticipationAndManagement": {
    "content": "As a participant in a group, you agree to abide by the rules and guidelines for group interaction. Group leaders are responsible for managing the group in accordance with our guidelines and facilitating contributions and payouts."
  },
  "defaultManagementAndPenalties": {
    "content": "In case of a default on contributions, we will implement measures as described in our default management policy. Failure to meet your contribution obligations may result in penalties as outlined in these T&Cs."
  },
  "reputationAndExitSystem": {
    "content": "Your interactions with our system, including timely contributions, will influence your reputation score within our community. The reputation system details and the conditions for exiting the system are described in the relevant section of our platform."
  },
  "digitalPlatformUse": {
    "content": "You agree to use our digital platform responsibly and in compliance with all applicable laws. You must respect the privacy and data security of other users and not engage in any prohibited activities on the platform."
  },
  "legalAndRegulatoryCompliance": {
    "content": "Our services will be provided in compliance with all applicable laws and regulations. We reserve the right to modify our services to maintain compliance with legal standards."
  },
  "modificationOfTerms": {
    "content": "We reserve the right to modify these T&Cs at any time. You will be notified of any changes and continued use of our services will constitute your acceptance of the modified T&Cs."
  },
  "disputeResolution": {
    "content": "Any disputes arising from or related to the use of our services will be resolved through the processes outlined in this section, under the governing law and jurisdiction as specified."
  },
  "terminationAndSuspension": {
    "content": "We may suspend or terminate your account if you violate these T&Cs or for any other lawful reason. The process for account closure is outlined in this section."
  },
  "disclaimerOfWarrantiesAndLimitationOfLiability": {
    "content": "We provide our services 'as is' and do not offer any warranties. Our liability in connection with your use of our services is limited as described in this section."
  },
  "generalProvisions": {
    "content": "This section includes miscellaneous legal provisions and contact information for queries and notices."
  }
}